{
  "walkme": {
    "interpersonalFit": 17,
    "thrivingAtWork": 15,
    "experienceAndCompetency": 16,
    "recognitionAndCompensation": 14,
    "purposeAndInvolvement": 16,
    "glassdoorScore": 4,
    "numEmployees": 1000,
    "linkedinFollowers": 75000,
    "headquarters": "San Francisco, CA, USA",
    "stockTicker": "WKME",
    "stockPrice": 10.5,
    "primaryColor": "#2D9CDB",
    "top3Words": [
      "Transparent",
      "Innovative",
      "Competitive"
    ],
    "evpStatement": "WalkMe provides a supportive and innovative environment that empowers employees to grow professionally while contributing to cutting-edge digital adoption solutions.",
    "subcategories": {
      "diversityAndInclusion": 4,
      "leadershipEffectiveness": 4,
      "employeeAdvocacy": 4,
      "workplaceCulture": 5,
      "employerValueProposition": 4,
      "careerDevelopment": 3,
      "innovationAdvancement": 4,
      "workLifeBalance": 4,
      "employeeExperience": 4,
      "competencyUtilization": 4,
      "professionalGrowth": 4,
      "resourceAccess": 4,
      "compensationCompetitiveness": 3,
      "talentRetention": 4,
      "performanceRecognition": 3,
      "compensationTransparency": 4,
      "socialResponsibility": 4,
      "sustainabilityInitiatives": 4,
      "employeeEngagement": 4,
      "meaningfulWork": 4
    },
    "analysis": {
      "overview": "WalkMe showcases a strong commitment to innovation and employee support, with solid scores in interpersonal fit and purpose. However, areas such as career development and compensation competitiveness indicate room for improvement. The company's engagement in social responsibility and a transparent culture contribute positively to its employer brand.",
      "interpersonalFit": "WalkMe excels in creating a positive workplace culture, supported by effective leadership and strong employee advocacy. The company is active in promoting diversity and inclusion, contributing to a high level of interpersonal fit.",
      "thrivingAtWork": "The company's emphasis on innovation and work-life balance is evident, though opportunities for career development could be expanded to enhance the thriving aspect further. WalkMe's employer value proposition remains strong and compelling.",
      "experienceAndCompetency": "Employees at WalkMe generally feel competent and have access to necessary resources. Consistent employee experiences and opportunities for professional growth are notable strengths, though continuous enhancement in these areas is essential to maintain competitiveness.",
      "recognitionAndCompensation": "While WalkMe offers a transparent compensation structure, improvements in compensation competitiveness and performance recognition are needed to boost talent attraction and retention. Current benefits and recognition programs are modest but could be further developed.",
      "purposeAndInvolvement": "WalkMe is actively involved in social responsibility and sustainability initiatives, which align well with its business goals and provide employees with opportunities for meaningful work. Employee engagement in company objectives is strong, contributing to a sense of purpose among the workforce."
    },
    "timestamp": "2025-04-11T19:24:56.566Z"
  },
  "pendo": {
    "interpersonalFit": 16,
    "thrivingAtWork": 17,
    "experienceAndCompetency": 15,
    "recognitionAndCompensation": 16,
    "purposeAndInvolvement": 15,
    "glassdoorScore": 4.1,
    "numEmployees": 900,
    "linkedinFollowers": 30000,
    "headquarters": "Raleigh, North Carolina, USA",
    "stockTicker": null,
    "stockPrice": null,
    "primaryColor": "#F55A5A",
    "top3Words": [
      "Ambitious",
      "Innovative",
      "Communication"
    ],
    "evpStatement": "Pendo provides a dynamic environment focused on innovation and growth, empowering employees to make impactful contributions while offering a balanced work-life experience.",
    "subcategories": {
      "diversityAndInclusion": 4,
      "leadershipEffectiveness": 4,
      "employeeAdvocacy": 4,
      "workplaceCulture": 4,
      "employerValueProposition": 4,
      "careerDevelopment": 4,
      "innovationAdvancement": 5,
      "workLifeBalance": 4,
      "employeeExperience": 3,
      "competencyUtilization": 4,
      "professionalGrowth": 4,
      "resourceAccess": 4,
      "compensationCompetitiveness": 4,
      "talentRetention": 4,
      "performanceRecognition": 4,
      "compensationTransparency": 4,
      "socialResponsibility": 3,
      "sustainabilityInitiatives": 4,
      "employeeEngagement": 4,
      "meaningfulWork": 4
    },
    "analysis": {
      "overview": "Pendo excels in fostering an innovative and ambitious workplace culture, offering strong career development opportunities and a balanced work-life environment. However, there is room for improvement in communication, particularly regarding social responsibility and employee experience consistency.",
      "interpersonalFit": "Pendo demonstrates a strong commitment to diversity and inclusion, with effective leadership that aligns with company goals. Employee advocacy is well-supported, and workplace culture fosters positive relationships, though there is potential for enhanced communication.",
      "thrivingAtWork": "The company provides a robust Employer Value Proposition, with significant emphasis on innovation and technological advancement. Career development is prioritized, and work-life balance is well-maintained, contributing to overall employee satisfaction.",
      "experienceAndCompetency": "While Pendo offers consistent professional growth opportunities and access to necessary resources, there are minor inconsistencies in employee experience that could be addressed to ensure more uniform competency utilization across teams.",
      "recognitionAndCompensation": "Pendo maintains competitive compensation and benefits, with effective talent retention strategies. Performance recognition is consistent, and the compensation structure is transparent, although continuous efforts could further enhance employee appreciation.",
      "purposeAndInvolvement": "The company's social responsibility and sustainability initiatives are commendable, and employees are engaged in meaningful work that aligns with company goals. However, increasing the impact of these initiatives could further elevate Pendo's community involvement."
    },
    "email": "test@test.com",
    "timestamp": "2025-04-11T19:25:09.691Z"
  },
  "bilt": {
    "interpersonalFit": 14,
    "thrivingAtWork": 13,
    "experienceAndCompetency": 12,
    "recognitionAndCompensation": 11,
    "purposeAndInvolvement": 14,
    "glassdoorScore": 3.6,
    "numEmployees": 200,
    "linkedinFollowers": 5000,
    "headquarters": "New York, NY, USA",
    "stockTicker": null,
    "stockPrice": null,
    "primaryColor": "#FF5733",
    "top3Words": [
      "innovative",
      "dynamic",
      "overstretched"
    ],
    "evpStatement": "Bilt empowers individuals to build better with cutting-edge tools and a collaborative environment designed to inspire innovation and growth.",
    "subcategories": {
      "diversityAndInclusion": 3,
      "leadershipEffectiveness": 4,
      "employeeAdvocacy": 3,
      "workplaceCulture": 4,
      "employerValueProposition": 3,
      "careerDevelopment": 4,
      "innovationAdvancement": 4,
      "workLifeBalance": 2,
      "employeeExperience": 3,
      "competencyUtilization": 3,
      "professionalGrowth": 3,
      "resourceAccess": 3,
      "compensationCompetitiveness": 3,
      "talentRetention": 2,
      "performanceRecognition": 3,
      "compensationTransparency": 3,
      "socialResponsibility": 3,
      "sustainabilityInitiatives": 3,
      "employeeEngagement": 4,
      "meaningfulWork": 4
    },
    "analysis": {
      "overview": "Bilt is a company that emphasizes innovation and dynamic growth, which are reflected in its strong focus on leadership effectiveness and technological advancement. However, challenges such as work-life balance and talent retention suggest areas for development, indicating a need for more sustainable growth practices.",
      "interpersonalFit": "Bilt scores well in leadership effectiveness, indicating that its leaders are aligned with company goals and values. The company fosters a positive workplace culture, although there is room for improvement in its diversity and inclusion initiatives to enhance the sense of belonging among employees.",
      "thrivingAtWork": "The company offers a strong career development framework and is known for its innovation and technological advancement. However, employees report challenges with maintaining work-life balance, which could impact overall job satisfaction and productivity.",
      "experienceAndCompetency": "Bilt offers consistent employee experiences and utilizes employee competencies effectively. Yet, there is potential for enhancing professional growth opportunities and providing better access to resources to ensure employees can fully leverage their skills.",
      "recognitionAndCompensation": "While Bilt provides competitive compensation and benefits, the rates of talent retention are an area of concern. Improving transparency in compensation structures and enhancing performance recognition could help in retaining top talent.",
      "purposeAndInvolvement": "The company is actively engaged in social responsibility and sustainability initiatives, which aligns with its mission of innovation. Employees are involved in company goals and find their work meaningful, contributing to a sense of purpose and commitment to Bilt's mission."
    },
    "companyName": "Bilt",
    "timestamp": "2025-04-11T19:29:20.328Z"
  },
  "visa": {
    "interpersonalFit": 16,
    "thrivingAtWork": 17,
    "experienceAndCompetency": 18,
    "recognitionAndCompensation": 17,
    "purposeAndInvolvement": 18,
    "glassdoorScore": 4,
    "numEmployees": 21000,
    "linkedinFollowers": 1800000,
    "headquarters": "Foster City, California, USA",
    "stockTicker": "V",
    "stockPrice": 245.67,
    "primaryColor": "#1A1F71",
    "top3Words": [
      "bureaucratic",
      "innovative",
      "inclusive"
    ],
    "evpStatement": "Visa provides a dynamic and inclusive work environment where employees are empowered to drive innovation and contribute to shaping the future of digital payments.",
    "subcategories": {
      "diversityAndInclusion": 4,
      "leadershipEffectiveness": 4,
      "employeeAdvocacy": 4,
      "workplaceCulture": 4,
      "employerValueProposition": 4,
      "careerDevelopment": 4,
      "innovationAdvancement": 4,
      "workLifeBalance": 4,
      "employeeExperience": 4,
      "competencyUtilization": 4,
      "professionalGrowth": 4,
      "resourceAccess": 4,
      "compensationCompetitiveness": 4,
      "talentRetention": 4,
      "performanceRecognition": 4,
      "compensationTransparency": 4,
      "socialResponsibility": 4,
      "sustainabilityInitiatives": 4,
      "employeeEngagement": 4,
      "meaningfulWork": 4
    },
    "analysis": {
      "overview": "Visa excels in fostering an innovative and inclusive work environment, providing ample opportunities for professional growth and meaningful work. However, there are areas for improvement, such as reducing bureaucracy to enhance agility.",
      "interpersonalFit": "Visa demonstrates a strong commitment to diversity, equity, and inclusion, actively promoting a culture where all employees feel they belong. Leadership is generally effective and aligned with company goals, fostering positive employee advocacy. However, there is room for improvement in cultural relationships, as some employees report bureaucratic processes that can hinder interpersonal dynamics.",
      "thrivingAtWork": "Visa's Employer Value Proposition is robust, offering competitive benefits and a strong emphasis on career development and innovation. The organization provides a flexible work environment that supports work-life balance, enabling employees to thrive. Continuous technological advancement is a key focus, encouraging innovation across the board.",
      "experienceAndCompetency": "Employees at Visa experience a consistent and supportive work environment. The company ensures that employees can utilize their skills effectively and provides numerous opportunities for professional growth. Access to necessary resources and tools is generally adequate, supporting employees in their roles.",
      "recognitionAndCompensation": "Visa offers competitive compensation and benefits, with strong talent retention strategies. Performance recognition is a significant focus, ensuring employees feel appreciated for their contributions. However, there could be improved transparency in compensation structures to further enhance trust and satisfaction.",
      "purposeAndInvolvement": "Visa is committed to social responsibility and sustainability, actively engaging in initiatives that positively impact communities. Employees are engaged with company goals, and the work is often meaningful, contributing to a sense of purpose. Visa's efforts in corporate sustainability make it a leader in this area."
    },
    "companyName": "Visa",
    "timestamp": "2025-04-11T19:29:51.192Z"
  },
  "discover": {
    "interpersonalFit": 16,
    "thrivingAtWork": 17,
    "experienceAndCompetency": 15,
    "recognitionAndCompensation": 14,
    "purposeAndInvolvement": 16,
    "glassdoorScore": 3.8,
    "numEmployees": 18000,
    "linkedinFollowers": 150000,
    "headquarters": "Riverwoods, Illinois, USA",
    "stockTicker": "DFS",
    "stockPrice": 101.25,
    "primaryColor": "#FF6000",
    "top3Words": [
      "Innovative",
      "Supportive",
      "Bureaucratic"
    ],
    "evpStatement": "Discover provides a supportive and innovative environment where employees can thrive through comprehensive career development programs and a commitment to work-life balance.",
    "subcategories": {
      "diversityAndInclusion": 4,
      "leadershipEffectiveness": 3,
      "employeeAdvocacy": 4,
      "workplaceCulture": 5,
      "employerValueProposition": 4,
      "careerDevelopment": 4,
      "innovationAdvancement": 4,
      "workLifeBalance": 5,
      "employeeExperience": 4,
      "competencyUtilization": 4,
      "professionalGrowth": 3,
      "resourceAccess": 4,
      "compensationCompetitiveness": 3,
      "talentRetention": 3,
      "performanceRecognition": 4,
      "compensationTransparency": 4,
      "socialResponsibility": 4,
      "sustainabilityInitiatives": 4,
      "employeeEngagement": 4,
      "meaningfulWork": 4
    },
    "analysis": {
      "overview": "Discover excels in creating a supportive and innovative work environment with strong EVP and work-life balance initiatives. While the company demonstrates effective diversity and inclusion efforts and offers meaningful work, there is room for improvement in leadership alignment and professional growth opportunities. The presence of bureaucratic processes may deter some employees, but the overall workplace culture is supportive and focused on employee well-being.",
      "interpersonalFit": "Discover has implemented effective diversity, equity, inclusion, and belonging initiatives, contributing to a positive workplace culture. Leadership effectiveness and alignment could be enhanced to better support overall employee advocacy and brand ambassadorship. Employees generally feel positive about workplace relationships.",
      "thrivingAtWork": "Discover's strong employer value proposition, supported by career development and innovation initiatives, allows employees to thrive. The company particularly excels in offering flexibility and work-life balance, ensuring employees can manage personal and professional responsibilities effectively.",
      "experienceAndCompetency": "While Discover offers a consistent employee experience and opportunities to utilize skills, professional growth paths could be more clearly defined. Access to necessary resources and tools supports employees in performing their roles effectively, contributing to a competent workforce.",
      "recognitionAndCompensation": "Discover's compensation and benefits are competitive, yet there is room for growth in talent retention and compensation transparency. The company's efforts in performance recognition are noted, but further improvements could enhance employee satisfaction and retention.",
      "purposeAndInvolvement": "Discover actively engages in social responsibility and sustainability initiatives, allowing employees to participate in meaningful work. Engagement in company goals is strong, reflecting a shared sense of purpose among employees."
    },
    "companyName": "Discover",
    "timestamp": "2025-04-11T19:32:06.333Z"
  },
  "american express": {
    "interpersonalFit": 16,
    "thrivingAtWork": 17,
    "experienceAndCompetency": 18,
    "recognitionAndCompensation": 16,
    "purposeAndInvolvement": 17,
    "glassdoorScore": 4.1,
    "numEmployees": 64000,
    "linkedinFollowers": 2800000,
    "headquarters": "New York, NY, USA",
    "stockTicker": "AXP",
    "stockPrice": 150,
    "primaryColor": "#002663",
    "top3Words": [
      "Innovative",
      "Supportive",
      "Bureaucratic"
    ],
    "evpStatement": "American Express provides a collaborative environment that fosters professional growth while encouraging employees to make meaningful contributions in a globally recognized company.",
    "subcategories": {
      "diversityAndInclusion": 4,
      "leadershipEffectiveness": 4,
      "employeeAdvocacy": 4,
      "workplaceCulture": 4,
      "employerValueProposition": 4,
      "careerDevelopment": 4,
      "innovationAdvancement": 4,
      "workLifeBalance": 5,
      "employeeExperience": 5,
      "competencyUtilization": 4,
      "professionalGrowth": 5,
      "resourceAccess": 4,
      "compensationCompetitiveness": 4,
      "talentRetention": 4,
      "performanceRecognition": 4,
      "compensationTransparency": 4,
      "socialResponsibility": 4,
      "sustainabilityInitiatives": 4,
      "employeeEngagement": 4,
      "meaningfulWork": 5
    },
    "analysis": {
      "overview": "American Express displays strong workbrand elements, notably in its innovative and supportive culture. While the company shows commitment to diversity and leadership effectiveness, there is room for improvement in reducing bureaucracy to streamline processes and enhance employee advocacy.",
      "interpersonalFit": "American Express has robust Diversity, Equity, Inclusion, and Belonging initiatives, paired with effective leadership. However, the organization can improve employee advocacy by encouraging more brand ambassadorship. The workplace culture is supportive, but there is potential to further enhance interpersonal relationships.",
      "thrivingAtWork": "The company offers a solid Employer Value Proposition and career development opportunities. It is recognized for innovation and technological advancement, and provides excellent work-life balance. Continued focus on these areas will ensure employees thrive in a dynamic work environment.",
      "experienceAndCompetency": "Employees at American Express experience consistency and are able to utilize their skills effectively. There are ample opportunities for professional growth, and the necessary resources and tools are generally accessible, contributing to a positive employee experience.",
      "recognitionAndCompensation": "American Express provides competitive compensation and benefits, with effective talent attraction and retention strategies. Performance recognition is balanced with transparency in compensation, though continual refinement in these areas will enhance employee satisfaction.",
      "purposeAndInvolvement": "The company demonstrates a commitment to social responsibility and sustainability, with significant employee engagement in company goals. Opportunities for meaningful work are prevalent, supporting a purpose-driven work environment."
    },
    "companyName": "American Express",
    "timestamp": "2025-04-11T19:32:48.612Z"
  }
}